apps/api/artillery/checkin.yml
config:
  target: "http://localhost:8000"
  http:
    timeout: 30
  plugins:
    expect: { outputFormat: silent }
  payload:
    path: "users.csv"
    fields:
      - "username"
      - "password"
    order: sequence
  phases:
    - duration: 1
      arrivalCount: 25

scenarios:
  - flow:
    - think: 5
    - post: 
        url: "/auth/signin"
        json:
          username: "{{ username }}"
          password: "{{ password }}"
        expect:
          - statusCode: 200
    - loop:
      - get:
          url: "/schools/location"
          expect:
            - statusCode: 200
      - think: 5     
      - post: 
          url: "/checkins"
          json:
            schoolId: 1
          expect:
            - statusCode: 201
      - think: 5
      count: 30